### 🧑🏻‍💻 노마's 파이썬 입문기 | Day ①
---
**[Check Point]**
- 파이썬은 오픈소스 프로그래밍 언어로 무료로 사용 가능하다.
- 파이썬은 '접착 언어'로 다른 프로그래밍 언어와 결합해 사용이 가능하다.
- 파이썬은 '대량의 고도화된 반복 연산이 필요한 프로그램'과 '모바일 앱' 개발에 적합하지 않다.
① 파이썬 실행방법
```python
cho@mingiui-MacBook-Air ~ % python3
```
② 파이썬 종료방법
```python
>>> exit()
>>> quit()

# import sys로 sys 라이브러리를 불러와 sys.exit() 명령어로 종료하는 방법도 있다.
# 혹은 Ctrl + z 도 가능하다.
```
③ 변수 활용
- 파이썬의 변수는 숫자와 문자값을 대입할 수 있다.
- 단, 문자의 경우 a = "python"과 같이 큰따옴표를 활용해 대입해야한다.

④ 조건문 if
- if 명령어를 통해 조건문을 작성할 수 있다.
- 조건문의 마무리에는 콜론(:)을 활용해 마무리한다.

⑤ 반복문 for, while
- For 반복문의 경우, [] 내에 있는 데이터를 순차적으로 반복하는 반복문이다.
- while 반복문의 경우, 특정 조건에 따라 데이터를 대입해 반복하는 반복문이다.

⑥ 함수
- def 명령어를 통해 함수를 호출한다.
- return 명령어를 통해 호출하고자 하는 값을 작성한다.
---
